{
	"publisher": "Palo Alto Networks, Inc.",
	"publisherDisplayName": "paloaltonetworks",
	"label": "vmseries1",
	"displayName": "VM-Series Next Generation Firewall 8.0.7",
	"imageReference": {
		"publisher": "paloaltonetworks",
		"offer": "vmseries1",
		"sku": "byol"
	},
	"OS": "Linux",
	"description": "<p>The VM-Series complements native Azure security features by uniquely classifying traffic based on the application identity and exerting policy-based control to reduce your threat footprint. Using Threat Prevention, URL Filtering, WildFire and GlobalProtect subscriptions, the VM-Series provides full spectrum threat prevention, content scanning and mobile user security. The VM-Series can be deployed in Azure and Azure Government to support the following use cases:</p><p>The VM-Series can be deployed to support the following use cases:</p><p>Hybrid cloud to securely extend your existing data center into Azure Segmentation of applications and data - both inter-subnet and VNET-to-VNET Gateway protection for inbound and outbound applications </p><p>GlobalProtect to extend security policies to remote users and devices.</p><p>VM-Series bring your own license (BYOL) option allows you to pick and choose the VM-Series next generation firewall licenses, security subscriptions (Threat Prevention, WildFire, URL Filtering, GlobalProtect) and technical support that are appropriate for your needs. BYOL can be executed as an al-a-carte option or through an Enterprise Licensing Agreement (ELA) which provides you with a single authorization code for large scale deployments. Your support options include Standard Premium, Premium Plus, Premium Partner Support and US Government Support (Azure Government). All Support options offered in English (verbal and written) with local language support available through Premium Partner Support. More information on our support offerings can be found at https: //www.paloaltonetworks.com/services/support</p><p>NOTE: If you need technical Support assistance, you must register the VM-Series for Azure on the Palo Alto Networks Customer Support Portal to ensure your assistance needs are met in a timely manner. New Palo Alto Networks customers can register the VM-Series for Azure here: https: //support.paloaltonetworks.com/useraccount/PreRegister. Existing Palo Alto Networks customers can add the VM-Series for Azure to their current support account. For additional information or to obtain an evaluation license for BYOL, please contact your local Palo Alto Networks sales representative or channel partner <a href='http://azure.paloaltonetworks.com' target='_blank'>vmseries on Azure</a></p>", 
	"iconPath": "Icons",
	"categories": [
		"virtualMachine",
		"azureCertified",
		"virtualMachineRecommended"
	],
	"recommendedSizes": [
		"Standard_D3",
		"Standard_D4",
		"Standard_D3_v2",
		"Standard_D4_v2",
		"Standard_D5_v2",
		"Standard_A4"
	],
	"linksForEnvironments": [
		{
			"label": "Templates for VM-Series",
			"uri": {
				"Blackforest": "https://github.com/PaloAltoNetworks/"
			}
		},
		{
			"label": "VM-Series on Azure - Administrator Guide",
			"uri": {
				"Blackforest": "https://www.paloaltonetworks.com/documentation/80/virtualization/virtualization/set-up-the-vm-series-firewall-on-azure"
			}
		},
		{
			"label": "Sales and Contact",
			"uri": {
				"Blackforest": "https://www.paloaltonetworks.com/company/contact-sales"
			}
		},
		{
			"label": "Technical Support",
			"uri": {
				"Blackforest": "https://support.paloaltonetworks.com/SupportAccount/MyAccounts/245"
			}
		}
	],
	"defaultImageSizeGB": 60,
	"screenshot": null,
	"cloudEnvironments": [
		"Blackforest"
	]
}