{
    "publisher": "Barracuda",
    "label": "Barracuda Web Application Firewall (WAF) 7.8",
    "displayName": "Barracuda Web Application Firewall (WAF) 7.8",
    "MediaName": "810d5f35ce8748c686feabed1344911c__BarracudaWAF-7.8.2.008-pl2",
    "OS": "Linux",
    "description": "The Barracuda Web Application Firewall inspects inbound web traffic and blocks SQL injections, Cross-Site Scripting, malware uploads & application DDoS, or other attacks targeted at your web applications. It also inspects the responses from the back-end web servers for Data Loss Prevention (DLP). The integrated access control engine enables administrators to create granular access control policies for Authentication, Authorization & Accounting (AAA), which gives organizations strong authentication and user control. The onboard L4/L7 Load Balancing capabilities enable organizations to quickly add back-end servers to scale deployments as they grow. Its application acceleration capabilities, including SSL Offloading, caching, compression, and connection pooling, ensure faster application delivery of web application content.<p><strong>Highlights:</strong></p><ul><li>  Detects and blocks SQL injections, Cross-Site Scripting, malware uploads, application DDoS, or any other attacks against your application. Authentication and access control gives organizations authentication and user control.</li><li>Scans outbound traffic to detect sensitive data and can either mask or block the information from being leaked out.</li><li> Accelerates the delivery of web application contents utilizing capabilities such as caching, compression, and other traffic optimizations.</li></ul><p><strong>Note:</strong> This appliance is typically administered via a web user interface and ssh access is not required; setting the user and password currently has no effect.  A forward for TCP port 8000 will be created automatically when you deploy this image.  See <a href ='https://cloudvm.cudasvc.com/azure/deployment-waf-readme.html' target = '_blank'>https://cloudvm.cudasvc.com/azure/deployment-waf-readme.html</a> for details.</p>",
    "iconPath": "Icons",
    "categories": [
        "virtualMachine",
        "microsoftServer",
        "azure",
        "linux",
        "azureCertified"
    ],
    "recommendedSizes": [
        "Small",
        "Medium",
        "Large"
    ],
    "links": [
        {
            "label": "Learn more",
            "uri": "https://cloudvm.cudasvc.com/azure/deployment-waf-readme.html"
        },
        {
            "label": "Documentation",
            "uri": "https://techlib.barracuda.com/WAF/AzureDeploy"
        },
        {
            "label": "Pricing details",
            "uri": "http://azure.microsoft.com/en-us/pricing/details/virtual-machines/#linux"
        }
    ],
    "eula": "http://cloudvm.cudasvc.com/eula/waf-azure-eula.html",
    "privacy": "https://www.barracuda.com/legal/privacy",
    "screenshot": "Screenshots/winappfirewall.png",
    "endpoints": [
        {
            "endpointName": "Admin",
            "privatePort": 8000,
            "publicPort": 8000,
            "protocol": "tcp"
        }
    ]
}
