{
    "publisher": "Bitnami",
    "label": "DreamFactory 1.7",
    "displayName": "DreamFactory 1.7",
    "MediaName": "3422a428aaf14529884165693cbb90d3__DreamFactory_1.7.8-0_-_Ubuntu_14.04",
    "OS": "Linux",
    "description": "<p>DreamFactory is the ultimate REST API platform. It enables developers to rapidly mobilize enterprise data by streamlining the task of connecting modern front-end apps with databases and storage systems. DreamFactory handles all of the server-side software and backend integration, so that you can focus on what you do best: building great applications.</p><p>DreamFactory includes all of the services and capabilities needed to build cutting-edge applications for the desktop, tablet, or phone. All backend services are accessed through a REST API that supports both JSON and XML documents. This style of service interface is perfect for mobilizing enterprise data with either HTML5 or native applications.</p><p>Once deployed, DreamFactory provides a wide range of services including SQL Data, NoSQL Data, BLOB Storage, User Management, Application Hosting, and External Integration. Advanced features include server-side scripting and record-level access control.</p><ul><li><b>Connect to any database.</b> DreamFactory enables developers to connect to any database, file storage system, or external web service in minutes. It supports SQL databases such as MySQL, SQL Server, and PostgreSQL; and most NoSQL databases such as MongoDB and many file storage systems. </li><li><b>Develop for any device.</b> Develop modern applications for the phone, tablet, or desktop without writing server software. DreamFactory generates a Client SDK for HTML5 frameworks like jQuery, AngularJS, and Sencha, and a code library for native clients like iOS, Windows 8, and Android.</li><li><b>Enables secure and flexible access.</b> DreamFactory provides user and role management with access control, and powerful scripting functionality to customize the REST API requests and responses on the server.</li></ul><p>DreamFactory is freely available under the terms of the Apache License. Commercial support and professional services can be purchased from <a href='https://www.dreamfactory.com/pricing/support' target='_blank'>DreamFactory.com</a>.</p><p>DreamFactory Software Inc. develops and markets technology that enables developers to connect modern mobile apps to enterprise backend infrastructure in the cloud. Enterprises, web development agencies, and independent developers use DreamFactory to build secure, modern mobile apps and deploy them on any cloud or data center. For more information, visit <a href='www.dreamfactory.com' target='_blank'>www.dreamfactory.com</a>, or follow us on LinkedIn, Facebook and Twitter @dfsoftwareinc.</p><p>The DreamFactory cloud image for Microsoft Azure is developed and maintained by <a href='https://bitnami.com' target='_blank'>Bitnami</a>, the leading provider of application images for the cloud.</p>",
    "iconPath": "Icons/DreamFactory",
    "categories": [
        "virtualMachine",
        "microsoftServer",
        "azure",
        "linux",
        "azureCertified",
        "appInfra"
    ],
    "recommendedSizes": [
        "Small",
        "Medium",
        "Large"
    ],
    "links": [
        {
            "label": "Learn more",
            "uri": "https://www.dreamfactory.com/"
        },
        {
            "label": "Documentation",
            "uri": "https://www.dreamfactory.com/developers/documentation"
        },
        {
            "label": "Pricing details",
            "uri": "http://azure.microsoft.com/en-us/pricing/details/virtual-machines/#linux"
        }
    ],
    "eula": "http://www.apache.org/licenses/LICENSE-2.0.html",
    "privacy": "http://www.dreamfactory.com/privacy",
    "screenshot": "Screenshots/dreamfactory.png",
    "endpoints": [
        {
            "endpointName": "http",
            "privatePort": 80,
            "publicPort": 80,
            "protocol": "tcp"
        },
        {
            "endpointName": "https",
            "privatePort": 443,
            "publicPort": 443,
            "protocol": "tcp"
        }
    ]
}
