{
    "publisher": "Bitnami",
    "label": "eXo Platform Express 4",
    "displayName": "eXo Platform Express 4",
    "MediaName": "3422a428aaf14529884165693cbb90d3__eXo_Platform_Express_4.0.7-0_-_Ubuntu_14.04",
    "OS": "Linux",
    "description": "<p>eXo Platform combines collaboration, content and document management, calendaring and other productivity tools with social features to provide a complete intranet for the enterprise. Rich collaboration features such as wikis, forums, calendars and documents are smartly integrated around activity streams, social networking and workspaces. It is carefully designed to instantly engage users. It is open source and runs within the trusted security of an enterprise platform and is highly customizable to adapt to your organizational needs. To continue using the image at the end of the trial period, you must purchase a license directly from eXo Platform. To learn more, visit: <a href='http://www.exoplatform.com' target= '_blank'>https://www.exoplatform.com</a></p><p>This 30 day free evaluation of eXo Platform Express gives you time to explore features such as:</p><p>Social Networking:<ul><li>User profiles: Personalized avatars, job titles, skills and more.</li><li>Connections: Connect to other team members. </li><li>Activity streams: Follow what connections are sharing, such as status, documents and links.</li></ul></p><p>Collaboration:<ul><li>Collaboration workspaces: Allow teams to share documents, tasks, events, wikis and more.</li><li>Wikis: Build documentation, knowledge bases and more with templates and a WYSIWYG editor.</li><li>Forums: Full-featured forums include moderation, permissions, polls, notifications, locking, bans and search.</li></ul></p><p>Content Management:<ul><li>Documents: Easy file uploads, document sharing, versioning, metadata, advanced search and digital asset management.</li><li>Websites: Create, classify and search content easily with the powerful website builder.</li><li>Unified search: Search any type of content, including documents, events, tasks, posts and articles from a single interface.</li></ul></p><p>Productivity:<ul><li>Dashboards: Customizable dashboards track metrics, feeds, status and analytics.</li><li>Calendars: Multi-calendar application provides reminders, invitations and free/busy time.</li><li>Tasks: Create and manage task lists, add tasks to your calendar and set reminders.</li></ul></p><p>This eXo Platform Express VM is built and maintained by <a href='https://bitnami.com' target= '_blank'>Bitnami</a>, the leading provider of application images for the cloud.</p>",
    "iconPath": "Icons/eXo",
    "categories": [
        "virtualMachine",
        "microsoftServer",
        "azure",
        "linux",
        "azureCertified"
    ],
    "recommendedSizes": [
        "Standard_D1",
        "Small",
        "Standard_DS2"
    ],
    "links": [
        {
            "label": "Learn more",
            "uri": "https://bitnami.com/stack/exo-platform/commercial"
        },
        {
            "label": "Documentation",
            "uri": "http://www.exoplatform.com/company/en/resource-center"
        },
        {
            "label": "Pricing details",
            "uri": "http://azure.microsoft.com/en-us/pricing/details/virtual-machines/#linux"
        }
    ],
    "eula": "http://www.exoplatform.com/terms-conditions",
    "privacy": "http://www.exoplatform.com/company/en/privacy",
    "screenshot": "Screenshots/exo.png",
    "endpoints": [
        {
            "endpointName": "http",
            "privatePort": 80,
            "publicPort": 80,
            "protocol": "tcp"
        },
        {
            "endpointName": "https",
            "privatePort": 443,
            "publicPort": 443,
            "protocol": "tcp"
        }
    ]
}
