{
    "publisher": "Microsoft",
    "publisherDisplayName": "Microsoft Corporation",
    "label": "FreeBSD 10.3",
    "displayName": "FreeBSD 10.3",
    "mediaReferences": {
        "PublicAzure": {
            "mediaName": "9db562c525e942698c605df2f0c9b26a__FreeBSD10_3-2016-11-11"
        },
        "Mooncake": {
            "mediaName": "7f4fdaae86b44261885f4eceac5f33b1__FreeBSD10_3-2016-11-11"
        }
    },
    "imageReference": {
        "publisher": "MicrosoftOSTC",
        "offer": "FreeBSD",
        "sku": "10.3"
    },
    "OS": "Linux",
    "description": "<p>FreeBSD 10.3 for Microsoft Azure provided by Microsoft Corporation. FreeBSD is an advanced computer operating system used to power modern servers, desktops and embedded platforms.</p><p>The FreeBSD Logo and the mark FreeBSD are registered trademarks of The FreeBSD Foundation and are used by Microsoft Corporation with the permission of The FreeBSD Foundation.</p><p><b>Legal Terms</b></p><p>&copy; 2016 Microsoft Corporation. All rights reserved.</p><p>Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:</p><p><ol><li>Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.</li><li>Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.</li></ol></p><p>THIS SOFTWARE IS PROVIDED BY MICROSOFT 'AS IS' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL MICROSOFT OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</p><p>The views and conclusions contained in the software and documentation are those of the authors and should not be interpreted as representing official policies, either expressed or implied, of Microsoft Corporation.</p>",
    "iconPath": "Icons",
    "categories": [
        "virtualMachine",
        "microsoftServer",
        "azure",
        "appInfra",
        "virtualMachineRecommended"
    ],
    "recommendedSizes": [
        "Standard_DS1_v2",
        "Standard_DS2_v2",
        "Standard_DS11_v2",
        "Standard_DS1",
        "Standard_DS2",
        "Standard_DS11",
        "Standard_D1_v2",
        "Standard_D1",
        "Small"          
    ],
    "links": [
        {
            "label": "FreeBSD",
            "uri": "https://www.freebsd.org"
        },
        {
            "label": "Wiki",
            "uri": "https://wiki.freebsd.org/HyperV"
        },
        {
            "label": "Pricing details",
            "uri": "https://azure.microsoft.com/pricing/details/virtual-machines/"
        }
    ],
    "screenshot": null,
    "cloudEnvironments":  [
        "PublicAzure",
        "Mooncake"
    ]
}
